p3p/pio-framework-arduino-lpc176x/system/CMSIS/lib/usb/mscuser.cpp
/*----------------------------------------------------------------------------
 *      U S B  -  K e r n e l
 *----------------------------------------------------------------------------
 *      Name:    MSCUSER.C
 *      Purpose: Mass Storage Class Custom User Module
 *      Version: V1.10
 *----------------------------------------------------------------------------
 *      This software is supplied "AS IS" without any warranties, express,
 *      implied or statutory, including but not limited to the implied
 *      warranties of fitness for purpose, satisfactory quality and
 *      noninfringement. Keil extends you a royalty-free right to reproduce
 *      and distribute executable files created using this software for use
 *      on NXP Semiconductors LPC family microcontroller devices only. Nothing
 *      else gives you the right to use this software.
 *
 *      Copyright (c) 2005-2009 Keil Software.
 *---------------------------------------------------------------------------*/

extern "C" {
  #include <LPC17xx.h>
  #include <lpc17xx_wdt.h>
  #include <lpc_types.h>
  #include <debug_frmwrk.h>
}

#include <usb/usb.h>
#include <usb/msc.h>
#include <usb/usbcfg.h>
#include <usb/usbreg.h>
#include <usb/usbhw.h>
#include <usb/usbcore.h>
#include <usb/usbuser.h>
#include <usb/mscuser.h>
#include <Arduino.h>

#include <chanfs/diskio.h>
//uint8_t  block_cache[MSC_BLOCK_SIZE] __attribute__((section("USB_RAM"))) = {0};
uint8_t *block_cache = (uint8_t *)DMA_BUF_ADR;
DWORD MSC_BlockCount = 0;

uint32_t MemOK;                   /* Memory OK */

DWORD lba;                        /* start block */
DWORD transfer_count;             /* blocks to transfer */
DWORD length;
uint32_t block_offset;            /* current block offset*/

uint8_t  BulkStage;               /* Bulk Stage */

//uint8_t  BulkBuf[MSC_MAX_PACKET]; /* Bulk In/Out Buffer */
uint8_t    *BulkBuf = (uint8_t *)(DMA_BUF_ADR + MSC_BLOCK_SIZE);
uint8_t  BulkLen;                 /* Bulk In/Out Length */
Sense sense_data;

#define CMD_NONE   0
#define CMD_START  1
#define CMD_READ   2
#define CMD_WRITE  3
#define CMD_DELAY  4
volatile uint8_t deferred_cmd = 0;
volatile uint32_t missed_ops = 0;
#define CACHE_INVALID  0xffffffff
volatile DWORD cache_lba = CACHE_INVALID;

MSC_CBW CBW;                   /* Command Block Wrapper */
MSC_CSW CSW;                   /* Command Status Wrapper */
volatile uint8_t media_lock = 0;
volatile bool device_wants_lock = false;
volatile bool ep_in_stalled = false;

#define NO_LOCK 0
#define HOST_LOCK 1
#define DEVICE_LOCK 2

extern uint32_t millis();
extern void _delay_ms(int delay);
void MSC_RunDeferredCommands();

uint32_t MSC_Aquire_Lock() {
  if (media_lock == DEVICE_LOCK) return 0;

  NVIC_DisableIRQ(USB_IRQn);
  device_wants_lock = true;
  uint32_t end_millis = millis() + 1000;
  if(media_lock == HOST_LOCK) {
    NVIC_EnableIRQ(USB_IRQn);
    while(media_lock == HOST_LOCK) {
      MSC_RunDeferredCommands();
      if(((long)(end_millis - (millis())) < 0)) {
        _DBG("No signal from Host, Assume success\n");
        break;
      }
      WDT_Feed();
    }
  }
  NVIC_DisableIRQ(USB_IRQn);
  media_lock = DEVICE_LOCK;
  NVIC_EnableIRQ(USB_IRQn);
  MSC_SD_Release(0);
  _DBG("Device MSC Lock\n");
  device_wants_lock = false;
  return 0;
}

uint32_t MSC_Release_Lock() {
  if(media_lock != DEVICE_LOCK) {
    return 0; // Didn't have lock
  }
  MSC_SD_Init(0);
  //if(disk_status(0) != STA_NOINIT) disk_ioctl(0, GET_SECTOR_COUNT, (void *)(&MSC_BlockCount));
  _DBG("Device MSC Unlock\n");
  NVIC_DisableIRQ(USB_IRQn);
  media_lock = NO_LOCK;
  sense_data.set(Sense_KEY::UNIT_ATTENTION, Sense_ASC::MEDIA_CHANGED);
  NVIC_EnableIRQ(USB_IRQn);
  return 0;   // Released
}

uint32_t MSC_SD_Lock() {
  if(media_lock == DEVICE_LOCK || (device_wants_lock && CBW.CB[4])) {
    CSW.bStatus = CSW_CMD_FAILED;
    sense_data.set(Sense_KEY::NOT_READY, Sense_ASC::LOGICAL_UNIT_NOT_READY, Sense_ASCQ::DEVICE_IS_BUSY);
    MSC_SetCSW();
    _DBG("Device has Lock (or is waiting for lock) cannot Lock..\n");
    return 1;
  }

  if(CBW.CB[4]) {
    media_lock = HOST_LOCK;
    _DBG("OS MSC Lock\n");
  } else {
    media_lock = NO_LOCK;
    _DBG("OS MSC Unlock\n");
  }
  // logical_unit = CBW.CB[1] & 0xE0;
  CSW.bStatus = CSW_CMD_PASSED;
  MSC_SetCSW();
  return 0;
}

uint32_t MSC_SD_Release(uint8_t pdrv) {
  MSC_BlockCount = 0;
  deferred_cmd = CMD_NONE;
  return 0;
}

uint32_t MSC_SD_Init(uint8_t pdrv) {
  //_DBG("IO Address "); _DBD32((uint32_t) block_cache); _DBG("\n");
  DSTATUS ret = disk_initialize(pdrv);
  if(ret) return ret;
  deferred_cmd = CMD_NONE;
  cache_lba = CACHE_INVALID;
  if(disk_ioctl (pdrv, GET_SECTOR_COUNT, (void *)(&MSC_BlockCount))) return 1;
  return 0;
}

void MSC_Start() {
  if(MSC_SD_Init(0) != 0) {
    CSW.bStatus = CSW_CMD_FAILED;
    sense_data.set(Sense_KEY::NOT_READY, Sense_ASC::MEDIUM_NOT_PRESENT, Sense_ASCQ::MANUAL_INTERVENTION_REQUIRED);
    _DBG("Disk init failed\n");
  }
  else {
    CSW.bStatus = CSW_CMD_PASSED;
    sense_data.reset();
    media_lock = HOST_LOCK;
    _DBG("Disk init worked\n");
  }
  MSC_SetCSW();
}

static void MSC_QueueDMAWrite(uint8_t *pData, uint32_t cnt, bool trigger) {
  //_DBG("Write "); _DBD32((uint32_t) pData); _DBG(" "); _DBD32(cnt); _DBG("\n");
  USB_DMA_DESCRIPTOR desc;
  desc.BufAdr = (uint32_t) pData;
  desc.BufLen = cnt;
  desc.MaxSize = (cnt > 0 ? MSC_MAX_PACKET : 0);
  desc.InfoAdr = 0;
  desc.Cfg.Val = 0;
  uint32_t ret = USB_DMA_Setup(MSC_EP_IN, &desc, trigger);
  //_DBG("DMA Setup "); _DBD32(ret); _DBG("\n");
  //USB_DMA_Enable(MSC_EP_IN);
}


void MSC_DeferCommand(uint8_t cmd) {
  deferred_cmd = cmd;
}

#define STARTSTOP_STOPMOTOR        0x0
#define STARTSTOP_STARTMOTOR       0x1
#define STARTSTOP_EJECT            0x2
#define STARTSTOP_LOAD             0x3

void MSC_StartStopUnit() {
  switch (CBW.CB[4] & 0x03) {
    case STARTSTOP_EJECT:
      MSC_SD_Release(0);
      media_lock = NO_LOCK;
      _DBG("OS Media Ejected UNLOCK\n");
      break;
    case STARTSTOP_LOAD:
      if(MSC_BlockCount == 0) {
        MSC_DeferCommand(CMD_START);
        return;
      }
      media_lock = HOST_LOCK;
      _DBG("OS Media Mount LOCKED\n");
      break;
    default:
      _DBG("MSC_StartStopUnit unknown startstopunit sub command: ");
      _DBH(CBW.CB[4] & 0x03);
      _DBG("\n");
  }
  CSW.bStatus = CSW_CMD_PASSED;
  sense_data.reset();
  MSC_SetCSW();
}

