p3p/pio-framework-arduino-lpc176x/system/CMSIS/lib/usb/mscuser.cpp
/*
 *  MSC Mass Storage Reset Request Callback
 *   Called automatically on Mass Storage Reset Request
 *    Parameters:      None (global SetupPacket and EP0Buf)
 *    Return Value:    TRUE - Success, FALSE - Error
 */

uint32_t MSC_Reset (void) {
  //USB_DMA_Disable(MSC_EP_IN);
  _DBG("MSC_Reset state "); _DBD32(BulkStage); _DBG("\n");
  BulkStage = MSC_BS_CBW;
  ep_in_stalled = false;
  return (TRUE);
}

/*
 *  MSC Mass Storage Unstall request callback
 *   Called when one of the msc bulk endpoints is unstalled
 *    Parameters:      EPNum the endpoint that is being unstalled
 *    Return Value:    None
 */

void MSC_UnstallEP(uint32_t EPNum) {
  if ((EPNum == MSC_EP_IN) && ep_in_stalled) {
    /* Compliance Test: rewrite CSW after unstall */
    if (CSW.dSignature == MSC_CSW_Signature) {
      //USB_WriteEP(MSC_EP_IN, (uint8_t *) &CSW, sizeof(CSW));
      for(int i = 0; i < sizeof(CSW); i++)
        BulkBuf[i] = ((uint8_t *)&CSW)[i];
        //MSC_QueueDMAWrite((uint8_t *)&CSW, sizeof(CSW), true);
        MSC_QueueDMAWrite(BulkBuf, sizeof(CSW), true);
      //MSC_QueueDMAWrite((uint8_t *)&CSW, sizeof(CSW), true);

    }
    ep_in_stalled = false;
  }
}

void MSC_StallEP(uint32_t EPNum) {
  _DBG("Stall EP\n");
  USB_SetStallEP(EPNum);
  //USB_DMA_Setup(MSC_EP_IN, nullptr);
  // keep track of the stall state of the IN EP.
  if (EPNum == MSC_EP_IN)
    ep_in_stalled = true;
}

/*
 *  MSC Get Max LUN Request Callback
 *   Called automatically on Get Max LUN Request
 *    Parameters:      None (global SetupPacket and EP0Buf)
 *    Return Value:    TRUE - Success, FALSE - Error
 */

uint32_t MSC_GetMaxLUN (void) {

  EP0Buf[0] = 0;               /* No LUN associated with this device */
  return (TRUE);
}

bool MSC_CheckAvailable(void) {
  if (MSC_BlockCount == 0)
    sense_data.set(Sense_KEY::NOT_READY, Sense_ASC::MEDIUM_NOT_PRESENT, Sense_ASCQ::LOADABLE);
  else if (media_lock == DEVICE_LOCK)
    sense_data.set(Sense_KEY::NOT_READY, Sense_ASC::MEDIUM_NOT_PRESENT, Sense_ASCQ::REASON_UNKNOWN);
  else if (device_wants_lock) {
    sense_data.set(Sense_KEY::NOT_READY, Sense_ASC::MEDIUM_NOT_PRESENT, Sense_ASCQ::REASON_UNKNOWN);
    // indicate the device can have the lock
    media_lock = NO_LOCK;
  }
  else
    return true;
    //_DBG("Available fail\n");
  CSW.bStatus = CSW_CMD_FAILED;
  MSC_SetCSW();
  return false;
}

bool host_get_lock(void) {
  if (MSC_CheckAvailable()) {
    media_lock = HOST_LOCK;
    return true;
  }
  return false;
}

static void MSC_CompleteRead (void) {
  //uint32_t n = (length > MSC_MAX_PACKET) ? MSC_MAX_PACKET : length;
  //MSC_QueueDMAWrite(&block_cache[block_offset], n, true);
  //USB_WriteEP(MSC_EP_IN, &block_cache[block_offset], n);
  uint32_t n = (length > MSC_BLOCK_SIZE) ? MSC_BLOCK_SIZE : length;

  MSC_QueueDMAWrite(block_cache, n, true);

  block_offset += n;
  length -= n;
  CSW.dDataResidue -= n;

  if(block_offset >= MSC_BLOCK_SIZE) {
    block_offset = 0;
    ++lba;
  }

  if (length == 0) {
    BulkStage = MSC_BS_DATA_IN_LAST;
  }

  if (BulkStage != MSC_BS_DATA_IN) {
    CSW.bStatus = CSW_CMD_PASSED;
    sense_data.reset();
  }
}

/*
 *  MSC Memory Read Callback
 *   Called automatically on Memory Read Event
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */
void MSC_MemoryRead (void) {
  if (deferred_cmd != CMD_NONE){
    //MSC_QueueDMAWrite(block_cache, 0, true);
    _DBG("Defer1\n");
    return;
  }
  if(!host_get_lock()) {
    _DBG("Lock failed\n");
     return;
  }
  WDT_Feed();

  if (lba > MSC_BlockCount) {
    //_DBG("Invalid LBA\n");
  }

  if(lba != cache_lba) {
    MSC_DeferCommand(CMD_READ);
    //MSC_QueueDMAWrite(block_cache, 0, true);
    //_DBG("Defer2\n");
    return;
  }
  MSC_CompleteRead();
}


/*
 * Complete the write operation. May be called folowing a
 * deferred operation.
 */
static void MSC_CompleteWrite(void) {
  block_offset += BulkLen;
  length -= BulkLen;
  CSW.dDataResidue -= BulkLen;

  if(block_offset >= MSC_BLOCK_SIZE) {
    block_offset = 0;
    ++lba;
  }

  if ((length == 0) || (BulkStage == MSC_BS_CSW)) {
    CSW.bStatus = CSW_CMD_PASSED;
    sense_data.reset();
    MSC_SetCSW();
  }
}

/*
 *  MSC Memory Write Callback
 *   Called automatically on Memory Write Event
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_MemoryWrite (void) {
  if (deferred_cmd != CMD_NONE) {
    missed_ops++;
    return;
  }
  BulkLen = (uint8_t)USB_ReadEP(MSC_EP_OUT, BulkBuf);
  if(!host_get_lock()) {
     return;
  }
  WDT_Feed();
  for (uint32_t n = 0; n < BulkLen; n++) {
    block_cache[block_offset + n] = BulkBuf[n];
  }

  if(block_offset + BulkLen >= MSC_BLOCK_SIZE) {
    cache_lba = lba;
    if(!(disk_status(0) & STA_PROTECT)){
      //MSC_DeferCommand(CMD_WRITE);
      //return;
    }
  }
  MSC_CompleteWrite();
}


/*
 *  MSC Memory Verify Callback
 *   Called automatically on Memory Verify Event
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_MemoryVerify (void) {
  BulkLen = (uint8_t)USB_ReadEP(MSC_EP_OUT, BulkBuf);
  if(!host_get_lock()) {
     return;
  }
  WDT_Feed();


  block_offset += BulkLen;
  length -= BulkLen;
  CSW.dDataResidue -= BulkLen;

  if ((length == 0) || (BulkStage == MSC_BS_CSW)) {
    if(MemOK) {
      CSW.bStatus = CSW_CMD_PASSED;
      sense_data.reset();
    } else {
      CSW.bStatus = CSW_CMD_FAILED;
      sense_data.set(Sense_KEY::MEDIUM_ERROR);
    }
    MSC_SetCSW();
  }
}

/*
 * MSC_RunDeferredCommands
 * Called to allow comands that access shared hardware to run outside
 * of an interrupt context. hould be called from "main loop" of the
 * user program.
 */
void MSC_RunDeferredCommands() {
  uint32_t res;
  uint8_t cmd = deferred_cmd;
  if (cmd == CMD_NONE) return;
  //NVIC_DisableIRQ(USB_IRQn);
  //deferred_cmd = CMD_NONE;
  switch(cmd) {
    case CMD_NONE:
      break;
    case CMD_START:
      MSC_Start();
      break;
    case CMD_READ:
      //_DBG("Start read "); _DBD32(lba);
      res = disk_read (0, block_cache, lba, 1);
      //_DBG(" Res "); _DBD32(res); _DBG("\n");
      cache_lba = lba;
      //_DBG("Read block\n");
      //MSC_CompleteRead();
      break;
    case CMD_WRITE:
      disk_write(0, block_cache, cache_lba, 1);
      MSC_CompleteWrite();
      if (missed_ops > 0) {
        MSC_MemoryWrite();
        missed_ops = 0;
      }
      break;
    case CMD_DELAY:
      delay(10);
      BulkStage = MSC_BS_DATA_IN_LAST;
      break;
  }
  deferred_cmd = CMD_NONE;
  USB_DMA_Trigger(MSC_EP_IN);
  //NVIC_EnableIRQ(USB_IRQn);
}

