p3p/pio-framework-arduino-lpc176x/system/CMSIS/lib/usb/mscuser.cpp
/*
 *  MSC Get Command Block Wrapper Callback
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_GetCBW (void) {
  uint32_t n;

  for (n = 0; n < BulkLen; n++) {
    *((uint8_t *)&CBW + n) = BulkBuf[n];
  }
  if ((BulkLen == sizeof(CBW)) && (CBW.dSignature == MSC_CBW_Signature)) {
    /* Valid CBW */
    CSW.dTag = CBW.dTag;
    CSW.dDataResidue = CBW.dDataLength;
    if ((CBW.bLUN != 0) || (CBW.bCBLength < 1) || CBW.bCBLength > 16) {
fail: CSW.bStatus = CSW_CMD_FAILED;
      sense_data.set(Sense_KEY::ILLEGAL_REQUEST);
      MSC_SetCSW();
      _DBG("Unsupported SCSI OP code ");
      _DBH(CBW.CB[0]);
      _DBG("\n");
    } else {
      //_DBG("CBW "); _DBD32(CBW.CB[0]); _DBG("\n");
      switch (CBW.CB[0]) {
        case SCSI_TEST_UNIT_READY:
          MSC_TestUnitReady();
          break;
        case SCSI_REQUEST_SENSE:
          MSC_RequestSense();
          break;
        case SCSI_FORMAT_UNIT:
          goto fail;
        case SCSI_INQUIRY:
          MSC_Inquiry();
          break;
        case SCSI_START_STOP_UNIT:
          MSC_StartStopUnit();
          break;
        case SCSI_MEDIA_REMOVAL:
          MSC_SD_Lock();
          break;
        case SCSI_MODE_SELECT6:
          goto fail;
        case SCSI_MODE_SENSE6:
          MSC_ModeSense6();
          break;
        case SCSI_MODE_SELECT10:
          goto fail;
        case SCSI_MODE_SENSE10:
          MSC_ModeSense10();
          break;
        case SCSI_READ_FORMAT_CAPACITIES:
          MSC_ReadFormatCapacity();
          break;
        case SCSI_READ_CAPACITY:
          MSC_ReadCapacity();
          break;
        case SCSI_READ10:
          if (MSC_RWSetup()) {
            if ((CBW.bmFlags & 0x80) != 0) {
              BulkStage = MSC_BS_DATA_IN;
              MSC_MemoryRead();
            } else {
              CSW.bStatus = CSW_PHASE_ERROR;
              MSC_SetCSW();
            }
          }
          break;
        case SCSI_WRITE10:
          if (MSC_RWSetup()) {
            if ((CBW.bmFlags & 0x80) == 0) {
              BulkStage = MSC_BS_DATA_OUT;
            } else {
              CSW.bStatus = CSW_PHASE_ERROR;
              MSC_SetCSW();
            }
          }
          break;
        case SCSI_VERIFY10:
          if (MSC_RWSetup()) {
            if ((CBW.bmFlags & 0x80) == 0) {
              BulkStage = MSC_BS_DATA_OUT;
              MemOK = TRUE;
            } else {
              CSW.bStatus = CSW_PHASE_ERROR;
              MSC_SetCSW();
            }
          }
          break;
        case 0x35: // SCSI_SYNCHRONIZECACHE10
          _DBG("SCSI_SYNCHRONIZECACHE10 Unsupported\n");
          CSW.bStatus = CSW_CMD_FAILED;
          sense_data.set(Sense_KEY::ILLEGAL_REQUEST);
          MSC_SetCSW();
          break;
        case 0x9E: // SCSI_SERVICEACTIONIN16
          _DBG("ServiceAction(16) Action: ");
          _DBH(CBW.CB[1]);
          _DBG(" Unsupported\n");
          CSW.bStatus = CSW_CMD_FAILED;
          sense_data.set(Sense_KEY::ILLEGAL_REQUEST);
          MSC_SetCSW();
          break;
        default:
          goto fail;
      }
    }
  } else {
    /* Invalid CBW */
    MSC_StallEP(MSC_EP_IN);
    MSC_StallEP(MSC_EP_OUT);
    BulkStage = MSC_BS_ERROR;
  }
}


/*
 *  MSC Set Command Status Wrapper Callback
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_SetCSW (void) {
  uint32_t sep;
  BulkStage = MSC_BS_CSW;
  CSW.dSignature = MSC_CSW_Signature;
  // Stall endpoint if required see: http://www.usb.org/developers/docs/devclass_docs/usbmassbulk_10.pdf
  if (CSW.dDataResidue != 0) {
    _DBG("Stall data residue "); _DBD32(CBW.CB[0]); _DBG("\n");
    if ((CBW.bmFlags & 0x80) == 0) {
      MSC_StallEP(MSC_EP_OUT);
    }
    else {
      MSC_StallEP(MSC_EP_IN);
    }
  }
  if (CSW.bStatus == CSW_PHASE_ERROR) {
    MSC_StallEP(MSC_EP_IN);
  }

  //USB_WriteEP(MSC_EP_IN, (uint8_t *)&CSW, sizeof(CSW));
  for(int i = 0; i < sizeof(CSW); i++)
    BulkBuf[i] = ((uint8_t *)&CSW)[i];
    //MSC_QueueDMAWrite((uint8_t *)&CSW, sizeof(CSW), true);
    MSC_QueueDMAWrite(BulkBuf, sizeof(CSW), true);

}


/*
 *  MSC Bulk In Callback
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_BulkIn (void) {
  uint32_t n;
  //_DBG("Bulkin "); _DBH(BulkStage); _DBG("\n");
  switch (BulkStage) {
    case MSC_BS_DATA_IN:
      switch (CBW.CB[0]) {
        case SCSI_READ10:
          MSC_MemoryRead();
          break;
      }
      break;
    case MSC_BS_DATA_IN_LAST:
      //USB_DMA_Disable(MSC_EP_IN);
      MSC_SetCSW();
      break;
    case MSC_BS_DATA_IN_LAST_DELAY:
      MSC_DeferCommand(CMD_DELAY);
      break;
    case MSC_BS_CSW:
      BulkStage = MSC_BS_CBW;
      break;
  }
}


/*
 *  MSC Bulk Out Callback
 *    Parameters:      None (global variables)
 *    Return Value:    None
 */

void MSC_BulkOut (void) {
  //_DBG("Bulkout "); _DBH(BulkStage); _DBG("\n");
  switch (BulkStage) {
    case MSC_BS_CSW:
      // This phase will normally coincide with a BulkIn request. However
      // if interrupts are delayed then the the order of BulkIn/BulkOut
      // requests is not guaranteed. So we also handle it here.
      BulkStage = MSC_BS_CBW;
      /* FALLTHROUGH */
    case MSC_BS_CBW:
      BulkLen = (uint8_t)USB_ReadEP(MSC_EP_OUT, BulkBuf);
      MSC_GetCBW();
      break;
    case MSC_BS_DATA_OUT:
      switch (CBW.CB[0]) {
        case SCSI_WRITE10:
          MSC_MemoryWrite();
          break;
        case SCSI_VERIFY10:
          MSC_MemoryVerify();
          break;
        default:
        _DBG("unexpected op "); _DBD32(CBW.CB[0]); _DBG("\n");
      }
      break;
    default:
      _DBG("BO Phase error ");_DBD32(BulkStage); _DBG("\n");
      BulkLen = (uint8_t)USB_ReadEP(MSC_EP_OUT, BulkBuf);
      _DBG("Data len "); _DBD32(BulkLen); _DBG("\n");
      MSC_StallEP(MSC_EP_OUT);
      CSW.bStatus = CSW_PHASE_ERROR;
      MSC_SetCSW();
      break;
  }
}

void MSC_DMA (uint32_t event) {
  //_DBG("DMA event "); _DBD32(event); _DBG(" "); _DBD32(USB_DMA_Status(MSC_EP_IN)); _DBG("\n");
  uint32_t len;
  switch(event) {
    case USB_EVT_IN_DMA_EOT:
      //MSC_BulkIn();
      break;
    case USB_EVT_IN_DMA_NDR:
      //USB_DMA_Disable(MSC_EP_IN);
      MSC_BulkIn();
      break;
      case USB_EVT_IN_DMA_ERR:
      _DBG("Error "); _DBD32(USB_DMA_Status(MSC_EP_IN)); _DBG("\n");
      break;
  }
  //_DBG("End event "); _DBD32(event); _DBG("\n");
}
